In [2]:
import pandas as pd

In [10]:
df = pd.read_csv('../datasets/question3.csv')
df #print(df)

  Unnamed: 0  Column 1  Column 2  Column 3
0      Row 1      15.5     12.14     65.90
1      Row 2      18.6     23.56     45.20
2      Row 3      21.4     47.02     21.63
3      Row 4      23.7     63.56     36.12

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   Column 1    4 non-null      float64
 2   Column 2    4 non-null      float64
 3   Column 3    4 non-null      float64
dtypes: float64(3), object(1)
memory usage: 256.0+ bytes

In [12]:
df.describe()

        Column 1   Column 2   Column 3
count   4.000000   4.000000   4.000000
mean   19.800000  36.570000  42.212500
std     3.544949  23.121041  18.536277
min    15.500000  12.140000  21.630000
25%    17.825000  20.705000  32.497500
50%    20.000000  35.290000  40.660000
75%    21.975000  51.155000  50.375000
max    23.700000  63.560000  65.900000

In [8]:
df = pd.read_csv('../datasets/salesman.txt')
df #print(df)

   salesman_id        name      city  commission
0         5001  James Hoog  New York         0.15
1         5002  Nail Knite     Paris         0.13
2         5005    Pit Alex    London         0.11
3         5006     Mc Lyon     Paris         0.14
4         5007   Paul Adam      Rome         0.13
5         5003  Lauson Hen  San Jose         0.12

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   salesman_id  6 non-null      int64
 1   name         6 non-null      object
 2   city         6 non-null      object
 3   commission   6 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [13]:
df = pd.read_csv('../datasets/times2.csv', sep = ';')
df #print(df)

   1   6  12:01:03  0,50          WORST
0  2  16  07:42:51  0,32           BEST
1  3  19  12:01:29  0,50            NaN
2  4  13  03:22:50  0,14   INTERMEDIATE
3  5   8  09:30:03  0,40          WORST

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   1         4 non-null      int64
 1   6         4 non-null      int64
 2   12:01:03  4 non-null      object
 3   0,50      4 non-null      object
 4   WORST     3 non-null      object
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

In [5]:
df = pd.read_csv('../datasets/times.csv', usecols=['ID','SCORE','CLASS'])
df #print(df)

   ID  SCORE         CLASS
0   1      6         WORST
1   2     16          BEST
2   3     19          BEST
3   4     13  INTERMEDIATE
4   5      8         WORST
5   6     15          BEST

In [6]:
df = pd.read_csv('../datasets/question3.csv', usecols=[1,3])
df #print(df)

   Column 1  Column 3
0      15.5     65.90
1      18.6     45.20
2      21.4     21.63
3      23.7     36.12

In [7]:
df = pd.read_csv('../datasets/question3.csv', names=['name', 'value1', 'value2', 'value3'])
df #print(df)

    name    value1    value2    value3
0    NaN  Column 1  Column 2  Column 3
1  Row 1      15.5     12.14      65.9
2  Row 2      18.6     23.56      45.2
3  Row 3      21.4     47.02     21.63
4  Row 4      23.7     63.56     36.12

In [8]:
df = pd.read_csv('../datasets/question3.csv', names=['name', 'value1', 'value2', 'value3'], skiprows=1)
df #print(df)

    name  value1  value2  value3
0  Row 1    15.5   12.14   65.90
1  Row 2    18.6   23.56   45.20
2  Row 3    21.4   47.02   21.63
3  Row 4    23.7   63.56   36.12

In [9]:
df = pd.read_html('../datasets/page.html')
print('Total tables:', len(df))
print(df[0])
print(df[1])

Total tables: 2
                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy
             HEAD1            HEAD2
0  Row 1, Column 1  Row 1, Column 2
1  Row 2, Column 1  Row 2, Column 2

In [10]:
table1 = df[0]
table1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Contact  6 non-null      object
 2   Country  6 non-null      object
dtypes: object(3)
memory usage: 272.0+ bytes

In [11]:
print(table1['Company'])

0             Alfreds Futterkiste
1      Centro comercial Moctezuma
2                    Ernst Handel
3                  Island Trading
4    Laughing Bacchus Winecellars
5    Magazzini Alimentari Riuniti
Name: Company, dtype: object

In [12]:
df = pd.read_html('https://en.wikipedia.org/wiki/Economy_of_the_United_States', match='Nominal GDP')
df_GDP = df[0]
df_GDP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 9 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Year                                              41 non-null     object
 1   Nominal GDP(billions USD)                         41 non-null     float64
 2   GDP per capita(USD)                               41 non-null     int64
 3   GDP growth(real)                                  41 non-null     object
 4   Inflation rate(in %)                              41 non-null     object
 5   Unemployment(in %)                                41 non-null     object
 6   Budget balance(in % of GDP)[116]                  41 non-null     object
 7   Government debt held by public(in % of GDP)[117]  41 non-null     object
 8   Current accountbalance(in % of GDP)               40 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 3.0+ KB

In [14]:
df = pd.read_xml('../datasets/dataXML.xml')
print(df)

                          name  price  \
0              Belgian Waffles  $5.95
1   Strawberry Belgian Waffles  $7.95
2  Berry-Berry Belgian Waffles  $8.95
3                 French Toast  $4.50
4          Homestyle Breakfast  $6.95

                                         description  calories
0  Two of our famous Belgian Waffles with plenty ...       650
1  Light Belgian waffles covered with strawberrie...       900
2  Belgian waffles covered with assorted fresh be...       900
3  Thick slices made from our homemade sourdough ...       600
4  Two eggs, bacon or sausage, toast, and our eve...       950

In [15]:
print(df['name'])

0                Belgian Waffles
1     Strawberry Belgian Waffles
2    Berry-Berry Belgian Waffles
3                   French Toast
4            Homestyle Breakfast
Name: name, dtype: object